src/cf/src/Documents/ОприходованиеТоваров/ОприходованиеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОприходованиеТоваров</name>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыСкладскихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>Станок</name>
    <type>
      <types>CatalogRef.ПроизводственноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПересчётТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/InformationRegisters/ЦеныНоменклатурыПоставщиков/ЦеныНоменклатурыПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатурыПоставщиков</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ЦенаЕдиницыХранения</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>НоменклатураКонтрагента</name>
    <type>
      <types>CatalogRef.НоменклатураКонтрагентов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Documents/ОприходованиеТоваров/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	ЦенаВключаетНДС = Истина;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПересчётТоваров") Тогда
		ЗаполнитьПоПересчетуТоваров(ДанныеЗаполнения);
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	// Данные для проведения
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ТЗТоварыССериями", СерииИРазмещение.ОбъединитьТоварыССериями(ЭтотОбъект));

	// Блокировки
	Блокировка = Новый БлокировкаДанных;
	УправляемыеБлокировки.ТоварыВНаличии(Блокировка, ТЧТовары, МестоХранения);
	Блокировка.Заблокировать();
	// Формируем
	РегистрыНакопления.ТоварыВНаличии.СформироватьДвижения(ЭтотОбъект);
	// Записываем
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
	ЗагрузкаСтанков.ЗаполнитьСкладСтанкаДокумента(ЭтотОбъект, Отказ);
	// Строки, введённые до появления НДС в табличной части: сумма с НДС равна сумме.
	Для Каждого Стр Из ТЧТовары Цикл
		Если Стр.СуммаСНДС = 0 И Стр.Сумма <> 0 Тогда
			Стр.СуммаСНДС = Стр.Сумма;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Вид операции «По станку» (волна 5): вместо места хранения проверяется станок.
	ЗагрузкаСтанков.ПроверяемыеРеквизитыСкладаСтанка(ЭтотОбъект, ПроверяемыеРеквизиты);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Излишки пересчёта: строки с положительным отклонением, цена - прежняя, иначе последний приход (с НДС).
//
// Параметры:
//  Пересчет - ДокументСсылка.ПересчётТоваров - основание.
//
Процедура ЗаполнитьПоПересчетуТоваров(Пересчет)
	Основание = Пересчет;
	Организация = Пересчет.Организация;
	МестоХранения = Пересчет.МестоХранения;
	ВидОперации = Пересчет.ВидОперации;
	Станок = Пересчет.Станок;
	МасНоменклатура = Пересчет.ТЧТовары.ВыгрузитьКолонку("Номенклатура");
	Данные = Новый Структура;
	Данные.Вставить("ТЗЦены", РегистрыСведений.ЦеныНоменклатурыПоставщиков.ПоследнийПрайс(ТекущаяДатаСеанса(), МасНоменклатура));
	Данные.Вставить("СтавкиНДС", ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МасНоменклатура, "СтавкаНДС"));
	Данные.Вставить("ТЗПредыдущиеДанные", ТЧТовары.Выгрузить());
	ТЧТовары.Очистить();
	Для Каждого Стр Из Пересчет.ТЧТовары Цикл
		Отклонение = Стр.КоличествоУпаковокФакт - Стр.КоличествоУпаковок;
		Если Отклонение <= 0 Тогда Продолжить КонецЕсли;
		НС = ТЧТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Стр);
		НС.КоличествоУпаковок = Отклонение;
		НС.Количество = Стр.КоличествоФакт - Стр.Количество;
		ЗаполнитьЦенуИСтавкуСтроки(НС, Стр, Данные);
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(НС, ЦенаВключаетНДС);
	КонецЦикла;	
КонецПроцедуры

Процедура ЗаполнитьЦенуИСтавкуСтроки(НС, Стр, Данные)
	РеквизитыНоменклатуры = Данные.СтавкиНДС[Стр.Номенклатура];
	Если РеквизитыНоменклатуры <> Неопределено Тогда
		НС.СтавкаНДС = РеквизитыНоменклатуры.СтавкаНДС;
	КонецЕсли;
	Отбор = Новый Структура("Номенклатура, Характеристика, Упаковка", Стр.Номенклатура, Стр.Характеристика, Стр.Упаковка);
	Мас = Данные.ТЗПредыдущиеДанные.НайтиСтроки(Отбор);
	Если Мас.Количество() > 0 Тогда
		НС.Цена = Мас[0].Цена;
		Возврат;
	КонецЕсли;
	Мас = Данные.ТЗЦены.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", Стр.Номенклатура, Стр.Характеристика));
	Если Мас.Количество() > 0 Тогда
		НС.Цена = Мас[0].Цена * (НС.Количество / НС.КоличествоУпаковок);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
